In [20]:
import pandas as pd
import psycopg2

*** Customer ***

In [3]:
df_customer = pd.read_csv('data/customer.csv', encoding='utf-8', delimiter=';')
df_customer.head(3)

,customer_id,first_name,last_name,gender,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,address,postcode,state,country,property_valuation
0,1,Laraine,Medendorp,F,1953-10-12,Executive Secretary,Health,Mass Customer,N,Yes,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,Eli,Bockman,Male,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,Yes,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,3,Arlin,Dearle,Male,1954-01-20,Recruiting Manager,Property,Mass Customer,N,Yes,0 Holy Cross Court,4211,QLD,Australia,9

In [4]:
df_customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4000 entries, 0 to 3999
Data columns (total 15 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   customer_id            4000 non-null   int64
 1   first_name             4000 non-null   object
 2   last_name              3875 non-null   object
 3   gender                 4000 non-null   object
 4   DOB                    3913 non-null   object
 5   job_title              3494 non-null   object
 6   job_industry_category  3344 non-null   object
 7   wealth_segment         4000 non-null   object
 8   deceased_indicator     4000 non-null   object
 9   owns_car               4000 non-null   object
 10  address                4000 non-null   object
 11  postcode               4000 non-null   int64
 12  state                  4000 non-null   object
 13  country                4000 non-null   object
 14  property_valuation     4000 non-null   int64
dtypes: int64(3), object(12)
memory usage: 468.9+ KB

In [5]:
#
df_customer['gender'].value_counts()

gender
Female    2037
Male      1872
U           88
F            1
Femal        1
M            1
Name: count, dtype: int64

In [6]:
#
df_customer['gender'] = df_customer['gender'].replace({'F': 'Female', 'M': 'Male', 'U': 'Unknown', 'Femal': 'Female'})
df_customer['gender'].value_counts()

gender
Female     2039
Male       1873
Unknown      88
Name: count, dtype: int64

In [7]:
# Так как в заданиях нет запроса, чтобы использовалось поле DOB, то можно заменить пустые ячейки на '1900-01-01'
df_customer['DOB'] = pd.to_datetime(df_customer['DOB'])
df_customer['DOB'] = df_customer['DOB'].fillna(pd.Timestamp('1900-01-01'))

In [11]:
#
df_customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4000 entries, 0 to 3999
Data columns (total 15 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   customer_id            4000 non-null   int64
 1   first_name             4000 non-null   object
 2   last_name              3875 non-null   object
 3   gender                 4000 non-null   object
 4   DOB                    4000 non-null   datetime64[ns]
 5   job_title              3494 non-null   object
 6   job_industry_category  3344 non-null   object
 7   wealth_segment         4000 non-null   object
 8   deceased_indicator     4000 non-null   object
 9   owns_car               4000 non-null   object
 10  address                4000 non-null   object
 11  postcode               4000 non-null   int64
 12  state                  4000 non-null   object
 13  country                4000 non-null   object
 14  property_valuation     4000 non-null   int64
dtypes: datetime64[ns](1), int64(3), object(11)
memory usage: 468.9+ KB

In [40]:
# Устанавливаем соединение с базой данных
conn = psycopg2.connect(user="postgres", 
                        password="1234554321live##Test", 
                        host="localhost", 
                        database="postgres")

In [13]:
# Создаем объект курсора
cur = conn.cursor()

In [17]:
# Внесение данных в таблицу Customers
for index,row in df_customer.iterrows():
      cur.execute('''insert into homework_2.customer (customer_id, first_name, last_name,
                  gender, DOB, job_title, job_industry_category, wealth_segment, deceased_indicator,
                  owns_car, address, postcode, state, country, property_valuation) 
                  VALUES (%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s)''', 
                  (row['customer_id'], row['first_name'], row['last_name'], 
                   row['gender'], row['DOB'], row['job_title'], row['job_industry_category'], row['wealth_segment'], 
                   row['deceased_indicator'], row['owns_car'], row['address'], row['postcode'], row['state'], row['country'],
                   row['property_valuation']))

# Закрываем курсор и подтверждаем изменения в базе данных
conn.commit()

*** Transaction ***

In [34]:
df_transaction = pd.read_csv('data/transaction.csv', encoding='utf-8', delimiter=';')
df_transaction.head(3)

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost
0,1,2,2950,25.02.2017,False,Approved,Solex,Standard,medium,medium,"71,49","53,62"
1,2,3,3120,21.05.2017,True,Approved,Trek Bicycles,Standard,medium,large,"2091,47","388,92"
2,3,37,402,16.10.2017,False,Approved,OHM Cycles,Standard,low,medium,"1793,43","248,82"

In [35]:
df_transaction.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   transaction_id    20000 non-null  int64
 1   product_id        20000 non-null  int64
 2   customer_id       20000 non-null  int64
 3   transaction_date  20000 non-null  object
 4   online_order      19640 non-null  object
 5   order_status      20000 non-null  object
 6   brand             19803 non-null  object
 7   product_line      19803 non-null  object
 8   product_class     19803 non-null  object
 9   product_size      19803 non-null  object
 10  list_price        20000 non-null  object
 11  standard_cost     19803 non-null  object
dtypes: int64(3), object(9)
memory usage: 1.8+ MB

In [36]:
# Замена запятых на точки в столбцах list_price и standard_cost
df_transaction['list_price'] = df_transaction['list_price'].str.replace(',', '.').astype(float)
df_transaction['standard_cost'].fillna(0, inplace=True)
df_transaction['standard_cost'] = df_transaction['standard_cost'].str.replace(',', '.').astype(float)

#
df_transaction['transaction_date'] = pd.to_datetime(df_transaction['transaction_date'], dayfirst=True)

In [38]:
df_transaction.head()

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost
0,1,2,2950,2017-02-25,False,Approved,Solex,Standard,medium,medium,71.49,53.62
1,2,3,3120,2017-05-21,True,Approved,Trek Bicycles,Standard,medium,large,2091.47,388.92
2,3,37,402,2017-10-16,False,Approved,OHM Cycles,Standard,low,medium,1793.43,248.82
3,4,88,3135,2017-08-31,False,Approved,Norco Bicycles,Standard,medium,medium,1198.46,381.10
4,5,78,787,2017-10-01,True,Approved,Giant Bicycles,Standard,medium,large,1765.30,709.48

In [41]:
# Создаем объект курсора
cur = conn.cursor()
# Внесение данных в таблицу Transactions
for index,row in df_transaction.iterrows():
      cur.execute('''insert into homework_2.transaction (transaction_id, product_id, customer_id, transaction_date,	
                  online_order, order_status, brand, product_line, product_class, product_size, list_price, standard_cost) 
                  VALUES (%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s)''', 
                  (row['transaction_id'], row['product_id'], row['customer_id'], row['transaction_date'], 
                   row['online_order'], row['order_status'], row['brand'], row['product_line'], row['product_class'], 
                   row['product_size'], row['list_price'], row['standard_cost']))

# Закрываем курсор и подтверждаем изменения в базе данных
cur.close()
conn.commit()